/* empty css              */import{l as p,i as c,a as l,S as n}from"./experts-DosLqwW5.js";const d=[{name:"Екатерина Сергеевна Милованова",photo:"milovanova-photo",docs:[],title:"Директор",description:"Курирование реализации социальных проектов (в том числе за счёт грантовых средств), организация работы по сотрудничеству и выстраиванию партнёрских отношений, организация взаимодействия со специалистами-психологами, проведение мероприятий."},{name:"Дмитрий Владимирович Юрков",photo:"yurkov-photo",docs:["yurkov-1","yurkov-2","yurkov-3","yurkov-4","yurkov-5","yurkov-6"],title:"директор МАУ «Центр психолого-педагогической, медицинской и социальной помощи «Эго»",description:`педагог–психолог высшей категории, психиатр, судебный эксперт психолог
    (экспертный стаж 9 лет, специализация по вопросам экспертизы несовершеннолетних,
    детско-родительских отношений, сопровождение несовершеннолетних в уголовном процессе,
    этические экспертизы), почетный работник общего образования, Заслуженный педагог
    Красноярского края.`},{name:"Евгений Сергеевич Эгле",photo:"egle-photo",docs:["egle-1","egle-2","egle-3"],title:"И.о. директора МАУ «Центр психолого-педагогической, медицинской и социальной помощи «Сознание»",description:`Педагог-психолог высшей категории, медиатор.
    Медиация:
    - детско-родительских отношений;
    - супружеских споров;
    - при расторжении брака.`},{name:"Ярошевич Лариса Петровна",photo:"yaroshevich-photo",docs:["yaroshevich-1","yaroshevich-2","yaroshevich-3"],title:"педагог-психолог МАУ «ЦППМиСП «Эго», эксперт АНО ДО ЦППС «ГЕНЕЗИС»",description:`высшее психолого-педагогическое образование, высшая категорию педагога-психолога,
    стаж профессиональной деятельности 24 года.
    Направления деятельности:
    - Диагностика и коррекция детско-родительских отношений;
    - Определение уровня актуального развития детей от 0 до 18 лет;
    - Оценка детско-родительских отношений при проведении судебных и досудебных психологических экспертиз.`},{name:"Куцонец Александра Дияновна",photo:"kutsonets-photo",docs:[],title:`педагог-психолог высшей кв. категории, нейропсихолог,
    Московский психолого-социальный институт Специальность «Психология»
    Квалификация Психолог, преподаватель психологии стаж работы: 18 лет`,description:`нейропсихологическая диагностика, психологическая диагностика особенностей
    развития ребенка, определение уровня сформированности познавательной деятельности,
    способности к обучению, особенности эмоционально-волевой сферы, нейропсихологическая
    коррекция реализации коррекционно-развивающих программ с элементами игротерапии,
    арт-терапии, сказкотерапии, владение техниками НЛП и психодрамы, положительный и устойчивый
    результат коррекции и развития детей, с которыми ведется индивидуальная и групповая работа.`},{name:"Куницина Екатерина Александровна",photo:"kunitsina-photo",docs:[],title:`заместитель директора по работе с клиентами;
    высшее психолого-педагогическое образование, стаж профессиональной деятельности 6 лет`,description:`Эффективное взаимодействие с клиентами, обработка запросов и заявок на услуги,
    заключение контрактов, проведение консультаций по услугам.`},{name:"Седых Анастасия Евгеньевна ",photo:"sedykh-photo",docs:[],title:`Практический, клинический психолог, сертифицированный специалист с опытом работы более 6 лет, эксперт ЦППС «Генезис» по работе с новой методикой «Консультирование с помощью видеоигр»
`,description:"преодоление эмоционального выгорания и стресса, работа с психосоматикой, работа с тревожностью и нарушениями пищевого поведения, построение эффективных коммуникаций (в семье, паре, рабочей среде), поиск личных ресурсов и восстановление внутреннего равновесия."},{name:"Зинаида Владимировна Маз",photo:"maz-photo",docs:[],title:`Учитель - логопед высшей кв. категории. Красноярский педагогический университет имени
    В.П. Астафьева. Стаж работы 15 лет. Красноярский педагогический университет имени
    В.П. Астафьева. «Медицинский логопед» ВГАПС Волгоградская гуманитарная академия.`,description:`Представитель сложной, немаловажной и очень интересной профессии.
    Консультации, диагностика речевого развития, коррекция речи, индивидуальные логопедические
    занятия, логопедический массаж, логопедические приемы восстановления функций жевания и глотания.`}];window.addEventListener("load",()=>{p(d),c(),l()});const o=document.querySelectorAll(".light-switch");o.length>0&&o.forEach((e,i)=>{localStorage.getItem("dark-mode")==="true"&&(e.checked=!0),e.addEventListener("change",()=>{const{checked:t}=e;o.forEach((s,r)=>{r!==i&&(s.checked=t)}),e.checked?(document.documentElement.classList.add("dark"),localStorage.setItem("dark-mode",!0)):(document.documentElement.classList.remove("dark"),localStorage.setItem("dark-mode",!1))})});const a=[{title:"Консультирование",imgSrc:"consultation",content:["<ul><li>рецензия на психологические экспертизы;</li><li>этические экспертизы;</li><li>сопровождение несовершеннолетних в уголовном процессе.</li></ul>","<p>проведение психологического консультирования подростков и их родителей (законных представителей)</p>","<p>консультации по вопросам детско-родительских отношений, межличностных коммуникации и социализации детей и подростков, вопросам правового характера, связанным с воспитанием и обучением детей, профориентации, семейное консультирование)</p>","<p>реализация комплексной программы психологического сопровождения учителей общеобразовательных школ города Красноярска и Красноярского края с целью снижения виктимизации педагогов в случаях проявления агрессивного поведения школьников</p>"],paginationId:"pagination-consult"},{title:"Диагностика",imgSrc:"diagnostics",content:["<p>проведение психолого-педагогического обследования детей дошкольного и школьного возраста с целью определению уровня актуального развития и дальнейшего прохождения ПМПК. Составление рекомендаций по дальнейшему образовательному маршруту</p>","<p>диагностика уровня речевого развития, постановка, автоматизация и дифференциация звуков в речи</p>"],paginationId:"pagination-diagnostics"},{title:"Коррекция",imgSrc:"correction",content:["<p>проведение индивидуальных и групповых коррекционно-развивающих занятий с детьми дошкольного и младшего школьного возраста</p>","<p>использование нейропсихологических методик в работе с детьми с СДВГ, РАС, имеющими трудности обучения в школе, с нарушением внимания, памяти, мышления</p>","<p>проведение индивидуальных и групповых занятий с детьми старшего дошкольного возраста по подготовке к школе</p>"],paginationId:"pagination-correction"},{title:"Медиация",imgSrc:"mediation",content:["<p>Медиация – технология, позволяющая «услышать» друг друга и сэкономить время и ресурсы. В конфликте всегда есть выход!</p>"],paginationId:"pagination-mediation"}],m=document.querySelector(".main-swiper .swiper-wrapper");a.forEach(e=>{const i=document.createElement("div");i.className="swiper-slide",i.innerHTML=`
      <div class="rounded-md flex flex-col justify-center items-center">
        <h2 class="text-center">${e.title}</h2>
        <div class="flex justify-center items-center pt-5 pb-5">
          <img  src="/images/${e.imgSrc}.jpg" class="w-1/2 opacity-85 rounded-3xl" alt="${e.title}">
        </div>
        <div class="container swiper text-center">
          <div class="swiper-container child-swiper overflow-hidden">
            <div class="swiper-wrapper pb-5">
              ${e.content.map(t=>`<div class="swiper-slide px-2">${t}</div>`).join("")}
            </div>
            <div id="${e.paginationId}" class="swiper-pagination"></div>
          </div>
        </div>
      </div>
    `,m.appendChild(i)});new n(".main-swiper",{slidesPerView:1,spaceBetween:20,loop:!0,breakpoints:{640:{slidesPerView:1,spaceBetween:20},1024:{slidesPerView:3,spaceBetween:20}},navigation:{nextEl:".swiper-button-next",prevEl:".swiper-button-prev"},pagination:{el:".swiper-pagination",clickable:!0}});a.forEach(e=>{new n(`.child-swiper:has(#${e.paginationId})`,{slidesPerView:1,spaceBetween:10,loop:!0,nested:!0,grabCursor:"true",pagination:{el:`#${e.paginationId}`,clickable:!0,dynamicBullets:!0}})});new n(".swiper-container.video",{slidesPerView:1,loop:!0,centeredSlides:!0,navigation:{nextEl:"#button-next-video",prevEl:"#button-prev-video"},pagination:{el:".swiper-pagination",clickable:!0}});
